Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_SwiftProgrammingLanguage_ePub5.2/Swift_ePub_SPL-omegat.tmx
Source language: en_us
Languages: ja

source: A closure that consists of only a single expression is understood to return the value of that expression.
ja: １つの式だけから成るクロージャは、その式の値を返すと理解されます。

source: A collection of 21-bit Unicode scalar values, equivalent to the string’s UTF-32 encoding form (accessed with the string’s unicodeScalars property)
ja: 21ビットのUnicodeスカラー値の集まり、その文字列のUTF-32符号化方式と等しい（文字列のunicodeScalarsプロパティでアクセスされます）

source: A collection of UTF-16 code units (accessed with the string’s utf16 property)
ja: UTF-16符号単位の集まり（文字列のutf16プロパティでアクセスされます）

source: A collection of UTF-8 code units (accessed with the string’s utf8 property)
ja: UTF-８符号単位の集まり（文字列のutf8プロパティでアクセスされます）

source: A comma is allowed after the last element.
ja: ひとつのコンマが最後の要素のあとに許容されます。

source: A compile-time diagnostic statement causes the compiler to emit an error or a warning during compilation.
ja: コンパイル時診断文は、コンパイラにエラーまたは警告をコンパイルの間に発せさせます。

source: A compile-time diagnostic statement has the following forms:
ja: コンパイル時診断文は、以下の形式を持ちます：

source: A compound type may contain named types and other compound types.
ja: ひとつの複合の型は、名前付きの型や他の複合の型を含むかもしれません。

source: A computed property with a getter but no setter is known as a read-only computed property.
ja: ゲッターを持つ、しかしセッターはない計算プロパティは、読み出し専用の計算プロパティとして知られています。

source: A concrete type can conform to a particular protocol only once.
ja: ある具象型は、特定のプロトコルにただ一度だけ準拠できます。

source: A conditional compilation block allows code to be conditionally compiled depending on the value of one or more compilation conditions.
ja: 条件コンパイルブロックは、１つ以上のコンパイル条件の値に依存してコードが条件付きでコンパイルされるようにします。

source: A conflicting access to memory can occur when different parts of your code are trying to access the same location in memory at the same time.
ja: メモリアクセスの衝突は、あなたのコードの異なる部分がメモリの同じ位置に同じ時にアクセスしようとする場合に生じます。

source: A conforming type can provide additional functionality, as long as it satisfies these three requirements.
ja: それに準拠している型は、それがこれらの３つの要件を満たす限り、追加の機能性を提供することができます。

source: A conforming type can satisfy a failable protocol initializer requirement by implementing any kind of initializer.
ja: ある準拠している型は、失敗できるプロトコルイニシャライザ要件を満たすことが、どんな種類のイニシャライザを実装することによっても可能です。

source: A conforming type can satisfy a nonfailable protocol initializer requirement by implementing a nonfailable initializer or an init! failable initializer.
ja: ある準拠している型は、失敗できないプロトコルイニシャライザ要件を満たすことが、失敗できないイニシャライザまたはinit!失敗できるイニシャライザを実装することによって可能です。

source: A consistent use of Int for integer values aids code interoperability, avoids the need to convert between different number types, and matches integer type inference, as described in Type Safety and Type Inference.
ja: 整数値のためのIntの一貫した使用は、コードの相互運用性を支援して、異なる数の型の間で変換する必要を避けて、「型安全と型推論」で記述されるように、整数型推論に合致します。

source: A constant declaration defines an immutable binding between the constant name and the value of the initializer expression; after the value of a constant is set, it cannot be changed.
ja: 定数宣言は、定数名とイニシャライザ式の値の間の不変の束縛を定義します；定数の値が設定されたあと、それは変わることができません。

source: A constant or variable must have the same type as the value you want to assign to it.
ja: 定数または変数は、あなたがそれに代入したい値と同じ型を持たなければなりません。

source: A constant or variable of a certain class type may actually refer to an instance of a subclass behind the scenes.
ja: 特定のクラス型の定数または変数は、舞台裏で実際にはあるサブクラスのインスタンスを参照するかもしれません。

source: A constant type property of a class is always implicitly final; you can’t mark it with the class or final declaration modifier to allow or disallow overriding by subclasses.
ja: あるクラスの定数型プロパティは、常に暗黙的に最終的なものです；あなたはそれをclassまたはfinal宣言修飾子で印できません、またはサブクラスによるオーバーライドを許可したり不許可にしたりできません。

source: A constant, variable, or property can’t be more public than its type.
ja: 定数、変数、またはプロパティは、その型よりもより公開であることはできません。

source: A convenience initializer must call another initializer from the same class.
ja: 便宜イニシャライザは、別のイニシャライザを同じクラスから呼ばなければなりません。

source: A convenience initializer must delegate to another initializer before assigning a value to any property (including properties defined by the same class).
ja: 便宜イニシャライザは、値を何らかのプロパティ（同じクラスによって定義されるプロパティを含む）に代入する前に、別のイニシャライザに委任しなければなりません。

source: A convenience initializer must ultimately call a designated initializer.
ja: 便宜イニシャライザは、最終的に指定イニシャライザを呼ばなければなりません。

source: A custom infix operator that is not explicitly placed into a precedence group is given a default precedence group with a precedence immediately higher than the precedence of the ternary conditional operator.
ja: ある優先順位グループの中に明示的に置かれないあつらえの接中辞演算子は、三項条件演算子の優先順位のすぐ上の優先順位を持つ省略時の優先順位グループを与えられます。

source: A decimal integer greater than zero
ja: ０より大きい10進法整数

source: A default initializer has the same access level as the type it initializes, unless that type is defined as public.
ja: 省略時のイニシャライザは、それが初期化する型と同じアクセス水準を持ちます、その型がpublicとして宣言される場合を除いて。

source: A default parameter called newValue is provided to your setter if you do not provide one yourself.
ja: あなたが独自のものを提供しないならば、newValueと呼ばれる省略時のパラメータがあなたのセッターに提供されます。

source: A deinitializer can be declared only in the body of a class declaration—but not in an extension of a class—and each class can have at most one.
ja: デイニシャライザは、クラス宣言の本文においてのみ ― しかしクラスの拡張においてではなく ― 宣言されることができます、そして各クラスが多くとも１つしか持つことができません。

source: A deinitializer is called automatically when there are no longer any references to a class object, just before the class object is deallocated.
ja: デイニシャライザは、あるクラスオブジェクトに対するいかなる参照ももはやない時、そのクラスオブジェクトが割り当て解除される直前に、自動的に呼ばれます。

source: A designated initializer for that class confirms that all stored properties introduced by that class have a value.
ja: そのクラスのための指定イニシャライザは、そのクラスによって導入される全ての格納プロパティが値を持つことを確かめます。

source: A designated initializer fully initializes all properties introduced by that class and calls an appropriate superclass initializer to continue the initialization process up the superclass chain.
ja: 指定イニシャライザは、そのクラスによって導入される全てのプロパティを完全に初期化して、適切なスーパークラスのイニシャライザを呼んで初期化プロセスを続けていきスーパークラス連鎖を上っていきます。

source: A designated initializer must call a designated initializer from its immediate superclass.
ja: 指定イニシャライザは、その直接のスーパークラスから指定イニシャライザを呼ばなければなりません。

source: A designated initializer must delegate up to a superclass initializer before assigning a value to an inherited property.
ja: 指定イニシャライザは、継承されたプロパティに代入する前にスーパークラスのイニシャライザへ委任しなければなりません。

source: A designated initializer must ensure that all of the properties introduced by its class are initialized before it delegates up to a superclass initializer.
ja: 指定イニシャライザは、それがスーパークラスのイニシャライザへと委任する前に、そのクラスによって導入されるプロパティの全てが初期化されることを確実にしなければなりません。

source: A designated initializer of a class initializes all of the class’s properties directly.
ja: あるクラスの指定イニシャライザは、直接そのクラスのプロパティの全てを初期化します。

source: A designated or convenience initializer is called on a class.
ja: 指定または便宜イニシャライザが、あるクラスで呼ばれます。

source: A dictionary Key type must conform to the Hashable protocol, like a set’s value type.
ja: ある辞書のKey型は、集合の持つ値型のように、Hashableプロトコルに準拠しなければなりません。

source: A dictionary literal is a shorthand way to write one or more key-value pairs as a Dictionary collection.
ja: 辞書リテラルは、Dictionaryコレクションとして１つ以上の「キーと値」の対を書く簡便な方法です。

source: A different function with the same matching type can be assigned to the same variable, in the same way as for nonfunction types:
ja: 同じ適合型を持つ異なる関数は、同じ変数に代入されることが可能です、それは非関数型に対するのと同じ方法で行えます：

source: A failable designated initializer can be overridden in a subclass by any kind of designated initializer.
ja: 失敗できる指定イニシャライザは、サブクラスにおいて任意の種類の指定イニシャライザでオーバーライドされることができます。

source: A failable initializer can also delegate to a nonfailable initializer.
ja: 失敗できるイニシャライザは、また、失敗できないイニシャライザへと委任することもできます。

source: A failable initializer can delegate to any kind of initializer.
ja: 失敗できるイニシャライザは、あらゆる種類のイニシャライザへ委任することができます。

source: A failable initializer can return nil at any point in the implementation of the initializer’s body.
ja: 失敗できるイニシャライザは、そのイニシャライザの本文の中の任意の地点でnilを返すことができます。

source: A failable initializer creates an optional value of the type it initializes.
ja: 失敗できるイニシャライザは、そのイニシャライザの型のオプショナルの値を作成します。

source: A failable initializer is used to find an appropriate enumeration case for a Character value representing a temperature symbol:
ja: 失敗できるイニシャライザは、ある温度記号で表されているCharacter値に対して適切な列挙ケース節を見つけるために使用されます：

source: A failable initializer of a class, structure, or enumeration can delegate across to another failable initializer from the same class, structure, or enumeration.
ja: クラス、構造体、または列挙のための失敗できるイニシャライザは、同じクラス、構造体、または列挙からの別の失敗できるイニシャライザに横つながりに委任することができます。

source: A failable initializer requirement can be satisfied by a failable or nonfailable initializer on a conforming type.
ja: 失敗できるイニシャライザ要件は、準拠している型上の失敗できるもしくは失敗できないイニシャライザによって満たされることができます。

source: A fourth value is pushed onto the top of the stack.
ja: 第４の値がスタックのてっぺんに押し込まれ（プッシュされ）ます。

source: A function call expression can include a trailing closure in the form of a closure expression immediately after the closing parenthesis.
ja: 関数呼び出し式は、終わりの括弧の直後にクロージャ式の形で後付クロージャを含むことができます。

source: A function can have at most one variadic parameter.
ja: 関数は最大で１つの可変長パラメータしか持つことができません。

source: A function can take another function as one of its arguments.
ja: ある関数は、その引数の１つとして別の関数をとることができます。

source: A function can’t have a higher access level than its parameter types and return type, because the function could be used in situations where its constituent types are unavailable to the surrounding code.
ja: 関数は、そのパラメータ型および戻り型より高いアクセス水準を持つことができません、なぜなら、その関数は、それの組成の型が周囲のコードに利用できない状況において使われることができるためです。

source: A function declaration whose statements include only a single expression is understood to return the value of that expression.
ja: それのstatementsがただ１つの式だけを含む関数宣言は、その式の値を返すものと理解されます。

source: A function declared in the context of class, structure, enumeration, or protocol is referred to as a method.
ja: クラス、構造体、列挙、またはプロトコルの文脈において宣言される関数は、メソッドとして言及されることができます。

source: A function definition can appear inside another function declaration.
ja: 関数定義は、別の関数宣言の内部に現れることができます。

source: A function has long-term write access to all of its in-out parameters.
ja: ある関数は長期書き込みアクセスをそれのin-outパラメータの全てに対して持ちます。

source: A function indicates that it can throw an error by including the throws keyword in its declaration.
ja: ある関数は、それがエラーをスローできることをthrowsキーワードをそれの宣言に含めることによって示します。

source: A function marked with throws is called a throwing function.
ja: throwsで印された関数は、スロー関数と呼ばれます。

source: A function may have at most one variadic parameter.
ja: 関数は、最大で１つの可変長パラメータしか持つことが出来ません。

source: A function or method can be declared with the rethrows keyword to indicate that it throws an error only if one of its function parameters throws an error.
ja: 関数またはメソッドは、rethrowsキーワードとともに宣言されて、それの関数パラメータの１つがエラーをスローする場合にのみそれがエラーをスローすることを指し示すことができます。

source: A function or method with an opaque return type hides its return value’s type information.
ja: 不透明戻り型をもつ関数またはメソッドは、それの戻り値のもつ型情報を隠します。

source: A function that tries to retrieve a web page might return the (Int, String) tuple type to describe the success or failure of the page retrieval.
ja: ウェブ・ページを探してくるある関数は、ページ検索の成功または失敗を記述するために(Int, String)のタプル型を返すかもしれません。

source: A function that uses an opaque type as its return type must return values that share a single underlying type.
ja: 不透明型をそれの戻り型として使う関数は、ある単一の基礎をなす型を共有する値を返さなければなりません。

source: A function type can have a variadic parameter in its parameter type.
ja: 関数型は、そのパラメータ型において可変長パラメータを持つことができます。

source: A function with a defined return type cannot allow control to fall out of the bottom of the function without returning a value, and attempting to do so will result in a compile-time error.
ja: ある定義された戻り型を持つ関数は、値を返すことなく関数の底を抜け落ちるように制御されることができません、そしてそうしようとすることはコンパイル時エラーに終わります。

source: A function with the Objective-C block calling convention can’t be converted to the C calling convention.
ja: Objective-Cブロック呼出規約での関数は、C呼出規約に変換されることはできません。

source: A function’s arguments must always be provided in the same order as the function’s parameter list.
ja: 関数の引数は、常にその関数のパラメータ一覧と同じ順序で提供されなければなりません。

source: A generic where clause enables you to require that an associated type must conform to a certain protocol, or that certain type parameters and associated types must be the same.
ja: 総称体where節は、ある関連型が特定のプロトコルに準拠しなければならないこと、または特定の型パラメータおよび関連型が同じでなければならないことをあなたが要求できるようにします。

source: A generic where clause consists of the where keyword, followed by a comma-separated list of one or more requirements.
ja: 総称体where節は、whereキーワード、それに続けてコンマ区切りのリストのひとつ以上の要件（requirements）から構成されます。

source: A generic where clause starts with the where keyword, followed by constraints for associated types or equality relationships between types and associated types.
ja: 総称体where節は、whereキーワードで始まり、関連型に対する制約がいくつか、または型と関連型の間の同等関係性がいくつか続きます。

source: A generic argument clause is enclosed in angle brackets (<>) and has the following form:
ja: 総称体引数節は、山形括弧（<>）に囲まれて、以下の形式を持ちます：

source: A generic parameter clause is enclosed in angle brackets (<>) and has the following form:
ja: 総称体パラメータ節は、山形括弧（<>）において囲まれて、以下の書式を持ちます：

source: A generic parameter consists of a type parameter followed by an optional constraint.
ja: 総称体パラメータは、型パラメータとそれに続く任意の制約から成ります。

source: A generic type may be able to satisfy the requirements of a protocol only under certain conditions, such as when the type’s generic parameter conforms to the protocol.
ja: 総称体型は、あるプロトコルの要件を満たすことが一定の条件の下でのみ可能でしょう、例えばその型のもつ総称体パラメータがそのプロトコルに準拠する場合など。

source: A hash value is an Int value that is the same for all objects that compare equally, such that if a == b, it follows that a.hashValue == b.hashValue.
ja: あるハッシュ値はあるひとつのInt値です、それは同等とみなされるすべてのオブジェクトに対して同じものです、たとえばa == bのように、それはa.hashValue == b.hashValueで導き出されます。

source: A key-path string expression lets you access the string used to refer to a property in Objective-C, for use in key-value coding and key-value observing APIs.
ja: キーパス文字列式は、あなたにObjective-Cでのプロパティを参照するために使われる文字列にアクセスさせます、キー値コーディングとキー値監視APIで使用するために。

source: A labeled statement is indicated by placing a label on the same line as the statement’s introducer keyword, followed by a colon.
ja: ラベルをつけられた文は、あるラベルをその文の導入子キーワードとして、コロンをその後に続けて同じ行に置くことによって示されます。

source: A line control statement has the following forms:
ja: 行制御文は以下の形式を持ちます：

source: A line control statement is used to specify a line number and filename that can be different from the line number and filename of the source code being compiled.
ja: 行制御文は、行番号とファイル名を指定するために使われます、それはコンパイルされているソースコードの行番号とファイル名とは異なっていることが可能です。

source: A literal doesn’t have a type on its own.
ja: リテラルはそれ独自の型を持ちません。

source: A long-term access can overlap with other long-term accesses and instantaneous accesses.
ja: 長期アクセスは、他の長期アクセスおよび即時アクセスでオーバーラップ可能です。

source: A method marked with the nonobjc attribute can’t override a method marked with the objc attribute.
ja: nonobjc属性で印されるメソッドは、objc属性で印されるメソッドをオーバーライドできません。

source: A module name
ja: あるモジュール名

source: A multiline string can be indented to match the surrounding code.
ja: 複数行文字列は、字下げされることによって、囲んでいるコードに調和します。

source: A multiline string literal can be indented using any combination of spaces and tabs; this indentation is not included in the string.
ja: 複数行文字列リテラルは、空白とタブの任意の組み合わせを使って字下げできます；この字下げはその文字列に含まれません。

source: A multiline string literal includes all of the lines between its opening and closing quotation marks.
ja: 複数行文字列リテラルは、それの開始および終了引用符の間のすべての行を含みます。

source: A multiline string literal is surrounded by three double quotation marks and has the following form:
ja: 複数行の文字列リテラルは、３つの二重引用符によって囲まれて、以下の形式を持ちます：

source: A mutating method on a structure has write access to self for the duration of the method call.
ja: ある構造体での変更メソッドは、selfに対する書き込みアクセスをそのメソッド呼び出しの継続期間にわたって持ちます。

source: A name before the parameter name gives the parameter an explicit argument label, which can be different from the parameter name.
ja: パラメータ名の前の名前は、そのパラメータに明示的な引数ラベルを与えます、それはパラメーター名と異なるものにできます。

source: A nested function can capture any of its outer function’s arguments and can also capture any constants and variables defined within the outer function.
ja: 入れ子にされた関数は、その外側の関数の持つ引数の何でも捕獲することができ、また外側の関数の範囲内で定義されるどんな定数や変数でも捕獲することができます。

source: A nested function is nonescaping if it captures a value that is guaranteed to never escape—such as an in-out parameter—or passed as a nonescaping function argument.
ja: 入れ子にされた関数は、決して脱出しないことを保証される値 — 例えばin-outパラメータ — を、または非脱出関数引数として渡される値を、もしそれがキャプチャするならば非脱出です。

source: A new Player instance is created, with a request for 100 coins if they are available.
ja: 新しいPlayerインスタンスが、それが可能ならば100のコインを要請して作成されます。

source: A nonfailable designated initializer can be overridden in a subclass by a nonfailable designated initializer only.
ja: 失敗できない指定イニシャライザは、サブクラスにおいて失敗できない指定イニシャライザでのみオーバーライドされることができます。

source: A nonfailable initializer can delegate to an init? failable initializer by force-unwrapping the result of the superclass’s initializer—for example, by writing super.init()!.
ja: 失敗できないイニシャライザは、init?失敗できるイニシャライザに委任することが、スーパークラスのイニシャライザの結果を強制アンラップすることによって可能です ― 例えば、super.init()!と書くことによって。

source: A nonfailable initializer can delegate to another nonfailable initializer or to an init! failable initializer.
ja: 失敗できないイニシャライザは、別の失敗できないイニシャライザへ、または失敗できるイニシャライザinit!へ委任することができます。

source: A nonfailable initializer requirement can be satisfied by a nonfailable initializer or an implicitly unwrapped failable initializer.
ja: 失敗できないイニシャライザ要件は、失敗できないイニシャライザまたは暗黙的にアンラップされる失敗できるイニシャライザによって満たされることができます。

source: A nongeneric global function, a local function that doesn’t capture any local variables or a closure that doesn’t capture any local variables can be converted to the C calling convention.
ja: 非総称体グローバル関数、何らローカル変数をキャプチャしないローカル関数または何らローカル変数をキャプチャしないクロージャは、C呼出規約に変換されることが可能です。

source: A nonreturning function or method can be called to conclude the else clause of a guard statement, as discussed in Guard Statement.
ja: 非復帰関数およびメソッドは、guard文のelse節で終わるために呼び出されることができます、guard文で議論されるように。

source: A number that won’t fit into a constant or variable of a sized integer type is reported as an error when your code is compiled:
ja: あなたのコードがコンパイルされるとき、ある大きさを設定された整数型の定数または変数に収まらない数はエラーとして報告されます：

source: A pair of parentheses still wrap the entire argument for the method.
ja: 一対の丸括弧は、依然としてこのメソッドに対する引数をすべて包みます。

source: A parameter has a name, which is used within the function body, as well as an argument label, which is used when calling the function or method.
ja: パラメータは名前を持ちます、それは関数本文内部で使われます、それだけでなく引数ラベルも、それは関数やメソッドが呼ばれる時に使われます。

source: A parameter of the function type () -> T (where T is any type) can apply the autoclosure attribute to implicitly create a closure at its call sites.
ja: 関数型() -> T（ここでTはどんな型でも）のあるパラメータは、autoclosure属性を適用することによって、あるクロージャを暗黙的にそれの呼び出し領域で作成することができます。

source: A parameter that’s a nonescaping function can’t be passed as an argument to another nonescaping function parameter.
ja: 非脱出関数であるパラメータは、別の非脱出関数パラメータに引数として渡されることはできません。

source: A parameter that’s a nonescaping function can’t be stored in a property, variable, or constant of type Any, because that might allow the value to escape.
ja: 非脱出関数であるパラメータは、型Anyのプロパティ、変数、または定数に格納できません、なぜならそれは値を脱出させることを許可するかもしれないからです。

source: A parameter with a base type name followed immediately by three dots (...) is understood as a variadic parameter.
ja: 基本の型の名前に直ちに３つの点（...）が続くパラメータは、可変長パラメータとして理解されます。

source: A parameter with an equals sign (=) and an expression after its type is understood to have a default value of the given expression.
ja: その型の後に等号（=）と式をもつパラメータは、与えられた式からなる省略時の値を持つと理解されます。

source: A postfix self expression consists of an expression or the name of a type, immediately followed by .self.
ja: 接尾辞self式は、ある式または型の名前と、それに直ちに続く.selfから成ります。

source: A precedence group declaration has the following form:
ja: 優先順位グループ定義は、以下の形式を持ちます：

source: A precedence group specifies an operator’s precedence relative to other infix operators, as well as the operator’s associativity.
ja: 優先順位グループは、他の接中辞演算子と相対的にある演算子の優先順位を、それだけでなく演算子の結合性も指定します。

source: A property declaration in a class is written the same way as a constant or variable declaration, except that it is in the context of a class.
ja: クラスの中のプロパティ宣言は、定数または変数の宣言と同じ方法で書かれます、ただしそれはクラスの前後関係の中にあります。

source: A property that has a property wrapper can include willSet and didSet blocks, but it can’t override the compiler-synthesized get or set blocks.
ja: プロパティラッパーを持つプロパティは、willSetとdidSetブロックを含むことができます、しかしそれはコンパイラが合成したgetまたはsetブロックをオーバーライドできません。

source: A property that normally returns an Int will return an Int? when accessed through optional chaining.
ja: 通常はIntを返すプロパティは、オプショナル連鎖を通してアクセスされるときInt?を返します。

source: A property wrapper adds a layer of separation between code that manages how a property is stored and the code that defines a property.
ja: プロパティラッパーは、プロパティが格納される方法を管理するコードとプロパティを定義するコードとの間に分離のレイヤー（層）を加えます。

source: A property wrapper can return a value of any type as its projected value.
ja: プロパティラッパーは、あらゆる型の値をそれの予測値として返せます。

source: A protocol can inherit one or more other protocols and can add further requirements on top of the requirements it inherits.
ja: プロトコルは、１つ以上の他のプロトコルを継承することができて、それが継承する要件の上に、更なる要件を加えることができます。

source: A protocol can appear as part of its own requirements.
ja: あるプロトコルは、それ自身の要件の一部として現れることができます。

source: A protocol can be used as the type to be stored in a collection such as an array or a dictionary, as mentioned in Protocols as Types.
ja: 型としてのプロトコルで言及されるように、プロトコルは型として使われることで、コレクション、例えば配列や辞書などに保管されることができます。

source: A protocol can require any conforming type to provide an instance property or type property with a particular name and type.
ja: あるプロトコルは、あらゆる準拠型に、特定の名前と型をもつインスタンスプロパティまたは型プロパティを提供するように要求することができます。

source: A protocol composition type allows you to specify a value whose type conforms to the requirements of multiple protocols without explicitly defining a new, named protocol that inherits from each protocol you want the type to conform to.
ja: プロトコル合成型は、あなたにそれの型が複数のプロトコルに属する要件に準拠するある値を、あなたがその型に準拠して欲しいプロトコル各々から継承する名前をつけられたある新しいプロトコルを明示的に定義する必要なしに指定させます。

source: A public type defaults to having internal members, not public members.
ja: 公開の型は特に何もしない状態では内部のメンバーを持ちます、公開のメンバーではなく。

source: A public variable can’t be defined as having an internal, file-private, or private type, because the type might not be available everywhere that the public variable is used.
ja: 公開の変数は、内部、ファイル外非公開、または非公開の型のものを持つように定義されることができません、なぜなら、その型は公開の変数が使われるあらゆる所で利用可能ではないからです。

source: A read-only computed property always returns a value, and can be accessed through dot syntax, but cannot be set to a different value.
ja: 読み出し専用の計算プロパティは常にある値を返します、そしてドット構文を通してアクセスされることができますが、異なる値に設定されることができません。

source: A recursive function is a straightforward way to work with data that has a recursive structure.
ja: 再帰関数は、率直な方法で再帰構造を持つデータを扱います。

source: A reference to the returned function is stored in a constant called moveNearerToZero.
ja: 返された関数への参照は、moveNearerToZeroと呼ばれる定数に格納されます。

source: A required initializer must have the same access level as the class it belongs to.
ja: 必須イニシャライザは、それが属しているクラスと同じアクセス水準を持たなければなりません。

source: A rethrowing function or method can contain a throw statement only inside a catch clause.
ja: 再度スローする関数やメソッドは、throw文をcatch節の内部にのみ含むことができます。

source: A selector expression lets you access the selector used to refer to a method or to a property’s getter or setter in Objective-C.
ja: セレクタ式は、あなたに、Objective-Cにおけるあるメソッドをまたはあるプロパティの持つゲッターやセッターを参照するために使われるセレクタにアクセスをさせます。

source: A semicolon (;) can optionally appear after any statement and is used to separate multiple statements if they appear on the same line.
ja: セミコロン（;）はあらゆる文の後に任意に現れることができて、複数の文をそれらが同じ行に現れる場合に別々に分けるために使われます。

source: A set type cannot be inferred from an array literal alone, so the type Set must be explicitly declared.
ja: 集合の型は配列リテラルのみでは推論されることができません、それで型Setが明示的に宣言されなければなりません。
